---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures
source: html/522aa648-2587-ed62-a1fd-57bbe0d469db.htm
---
# BuiltInFailures.StructuralCustomConnectionFailures Properties

Simple Structural Connection Handler cannot connect too far elements